app/Controllers/Cajas.php

SELECT *
FROM `cajas`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $cajas = $this->cajas->where('activo',$activo)->findAll();

SELECT *
FROM `cajas`
WHERE `codigo_cajas` = '200000001'
AND `activo` = 1
---
    public function buscarPorCodigo($codigo_cajas){
        $this->cajas->select('*');
        $this->cajas->where('codigo_cajas', $codigo_cajas);
        $this->cajas->where('activo',1);

        $datos = $this->cajas->get()->getRow();