app/Controllers/Calcular.php

    public function index($activo = 1)
    {
        $calcular = $this->calcular->where('activo',$activo)->findAll();
---
SELECT *
FROM `calcular`
WHERE `activo` = 1