app/Controllers/productos.php

    public function index($activo = 1)
    {
        $productos = $this->productos->where('activo',$activo)->findAll();
---
SELECT *
FROM `productos`
WHERE `activo` = 1

    public function editar($id)
    {
        $cajas = $this->cajas->where('activo',1)->findAll();
        $vehiculos = $this->vehiculos->where('activo', 1)->findAll();
        $producto = $this->productos->where('id' , $id)->first();
---
SELECT *
FROM `cajas`
WHERE `activo` = 1
SELECT *
FROM `vehiculos`
WHERE `activo` = 1
SELECT *
FROM `productos`
WHERE `id` = '23'
 LIMIT 1