app/Controllers/Sugerencias.php

SELECT *
FROM `sugerencias`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $sugerencias = $this->sugerencias->where('activo',$activo)->findAll();