app/Controllers/Usuarios.php

    public function claveNueva() //Cambiar contraseña en el login
    {
        if($this->request->getMethod() == "post" && $this->validate($this->reglasCambia)){

            $session =session();
            $idUsuario =$session->id_usuario;
            $hash = password_hash($this->request->getPost('password'), PASSWORD_DEFAULT);

            $this->usuarios->update($idUsuario, ['password' => $hash]);

            $usuario = $this->usuarios->where('id', $session->id_usuario)->first();
---
UPDATE `usuarios` SET `password` = '$2y$10$tEhXmiTTGkPLgpTQQENpquLi1w3DcdURfZ/Ay3PjHdolx0u8seDfa', `fecha_modifica` = '2024-05-14 22:12:19'
WHERE `usuarios`.`id` IN ('15')
SELECT *
FROM `usuarios`
WHERE `id` = '15'
 LIMIT 1