app/Controllers/Vehiculos.php

    public function index($activo = 1)
    {
        $vehiculos = $this->vehiculos->where('activo', $activo)->findAll();
---
SELECT *
FROM `vehiculos`
WHERE `activo` = 1

    public function buscarPorMaximo($maximo){
        $this->vehiculos->select('*');
        $this->vehiculos->where('maximo>=', $maximo-1);
        $this->vehiculos->where('maximo<=', $maximo+1);
       // $this->vehiculos->where('activo',1);
        $datos = $this->vehiculos->get()->getRow();
---
SELECT *
FROM `vehiculos`
WHERE `maximo` >= 2.18087
AND `maximo` <= 4.18087