app/Models/CajasModel.php

    public function totalCajas(){
        return $this->where('activo',1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `cajas`
WHERE `activo` = 1