app/Models/ProductosModel.php

SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `activo` = 1
---
    public function totalProductos(){
       return $this->where('activo',1)->countAllResults();