app/Models/VehiculosModel.php

    public function totalVehiculos(){
        return $this->where('activo',1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `vehiculos`
WHERE `activo` = 1